RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_efm.h
/**
 *******************************************************************************
 * @file  hc32f4a0_efm.h
 * @brief This file contains all the functions prototypes of the EFM driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Heqb           First version
   2020-07-03       Heqb           Add flag judgment when operate SWAP
   2020-07-07       Heqb           Modify the return value type of the function
                                   EFM_SetOperateMode from void to en_result_t
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_EFM_H__
#define __HC32F4A0_EFM_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_EFM
 * @{
 */

#if (DDL_EFM_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup EFM_Global_Types EFM Global Types
 * @{
 */

/**
 * @brief EFM configure structure
 */
typedef struct
{
    uint32_t            u32WaitCycle;   /*!< Specifies the efm read wait cycles.
                                            This parameter can be a value of @ref EFM_Wait_Cycle.             */

    uint32_t            u32CacheRst;    /*!< Specifies the data cache reset on or off.
                                            This parameter can be a value of @ref EFM_CacheRst_Func.       */

    uint32_t            u32Prefetch;    /*!< Specifies the prefetch on or off.
                                            This parameter can be a value of @ref EFM_Prefetch_Func.       */

    uint32_t            u32InsCache;    /*!< Specifies the instruction cache on or off.
                                            This parameter can be a value of @ref EFM_INSCache_Func.         */

    uint32_t            u32DataCache;   /*!< Specifies the data cache on or off.
                                            This parameter can be a value of @ref EFM_DCache_Func.          */

    uint32_t            u32LowVolRead;  /*!< Specifies the read of low-voltage mode on or off.
                                            This parameter can be a value of @ref EFM_LowVolRead_Mode.        */

    uint32_t            u32BusStatus;   /*!< Specifies the bus status busy or release while program & erase.
                                            This parameter can be a value of @ref EFM_Bus_Status.           */

    uint32_t            u32OperateMode; /*!< Specifies the operate mode.
                                            This parameter can be a value of @ref EFM_OperateMode_Definition.   */

    uint32_t            u32FlashStatus; /*!< Specifies the Flash status.
                                            This parameter can be a value of @ref EFM_Status.       */
} stc_efm_cfg_t;

/**
 * @brief EFM unique ID definition
 */
typedef struct
{
    uint32_t            u32UniqueID0;      /*!< unique ID 0.       */
    uint32_t            u32UniqueID1;      /*!< unique ID 1.       */
    uint32_t            u32UniqueID2;      /*!< unique ID 2.       */
} stc_efm_unique_id_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EFM_Global_Macros EFM Global Macros
 * @{
 */
#define EFM_SWAP_ADDR                (0x03002000UL)
#define EFM_SWAP_DATA                (0x005A5A5AUL)
/**
 * @defgroup EFM_Address EFM address area
 * @{
 */
#define EFM_START_ADDR               (0x00000000UL)   /*!< Flash start address */
#define EFM_END_ADDR                 (0x001FFFFFUL)   /*!< Flash end address */
/**
 * @}
 */

/**
 * @defgroup EFM_Sector_Address EFM Sector Address
 * @{
 */
#define EFM_ADDR_SECTOR0            (0x00000000UL)   /*!< Sector 0 */
#define EFM_ADDR_SECTOR1            (0x00002000UL)   /*!< Sector 1 */
#define EFM_ADDR_SECTOR2            (0x00004000UL)   /*!< Sector 2 */
#define EFM_ADDR_SECTOR3            (0x00006000UL)   /*!< Sector 3 */
#define EFM_ADDR_SECTOR4            (0x00008000UL)   /*!< Sector 4 */
#define EFM_ADDR_SECTOR5            (0x0000A000UL)   /*!< Sector 5 */
#define EFM_ADDR_SECTOR6            (0x0000C000UL)   /*!< Sector 6 */
#define EFM_ADDR_SECTOR7            (0x0000E000UL)   /*!< Sector 7 */
#define EFM_ADDR_SECTOR8            (0x00010000UL)   /*!< Sector 8 */
#define EFM_ADDR_SECTOR9            (0x00012000UL)   /*!< Sector 9 */
#define EFM_ADDR_SECTOR10           (0x00014000UL)   /*!< Sector 10 */
#define EFM_ADDR_SECTOR11           (0x00016000UL)   /*!< Sector 11 */
#define EFM_ADDR_SECTOR12           (0x00018000UL)   /*!< Sector 12 */
#define EFM_ADDR_SECTOR13           (0x0001A000UL)   /*!< Sector 13 */
#define EFM_ADDR_SECTOR14           (0x0001C000UL)   /*!< Sector 14 */
#define EFM_ADDR_SECTOR15           (0x0001E000UL)   /*!< Sector 15 */
#define EFM_ADDR_SECTOR16           (0x00020000UL)   /*!< Sector 16 */
#define EFM_ADDR_SECTOR17           (0x00022000UL)   /*!< Sector 17 */
#define EFM_ADDR_SECTOR18           (0x00024000UL)   /*!< Sector 18 */
#define EFM_ADDR_SECTOR19           (0x00026000UL)   /*!< Sector 19 */
#define EFM_ADDR_SECTOR20           (0x00028000UL)   /*!< Sector 20 */
#define EFM_ADDR_SECTOR21           (0x0002A000UL)   /*!< Sector 21 */
#define EFM_ADDR_SECTOR22           (0x0002C000UL)   /*!< Sector 22 */
#define EFM_ADDR_SECTOR23           (0x0002E000UL)   /*!< Sector 23 */
#define EFM_ADDR_SECTOR24           (0x00030000UL)   /*!< Sector 24 */
#define EFM_ADDR_SECTOR25           (0x00032000UL)   /*!< Sector 25 */
#define EFM_ADDR_SECTOR26           (0x00034000UL)   /*!< Sector 26 */
#define EFM_ADDR_SECTOR27           (0x00036000UL)   /*!< Sector 27 */
#define EFM_ADDR_SECTOR28           (0x00038000UL)   /*!< Sector 28 */
#define EFM_ADDR_SECTOR29           (0x0003A000UL)   /*!< Sector 29 */
#define EFM_ADDR_SECTOR30           (0x0003C000UL)   /*!< Sector 30 */
#define EFM_ADDR_SECTOR31           (0x0003E000UL)   /*!< Sector 31 */
#define EFM_ADDR_SECTOR32           (0x00040000UL)   /*!< Sector 32 */
#define EFM_ADDR_SECTOR33           (0x00042000UL)   /*!< Sector 33 */
#define EFM_ADDR_SECTOR34           (0x00044000UL)   /*!< Sector 34 */
#define EFM_ADDR_SECTOR35           (0x00046000UL)   /*!< Sector 35 */
#define EFM_ADDR_SECTOR36           (0x00048000UL)   /*!< Sector 36 */
#define EFM_ADDR_SECTOR37           (0x0004A000UL)   /*!< Sector 37 */
#define EFM_ADDR_SECTOR38           (0x0004C000UL)   /*!< Sector 38 */
#define EFM_ADDR_SECTOR39           (0x0004E000UL)   /*!< Sector 39 */
#define EFM_ADDR_SECTOR40           (0x00050000UL)   /*!< Sector 40 */
#define EFM_ADDR_SECTOR41           (0x00052000UL)   /*!< Sector 41 */
#define EFM_ADDR_SECTOR42           (0x00054000UL)   /*!< Sector 42 */
#define EFM_ADDR_SECTOR43           (0x00056000UL)   /*!< Sector 43 */
#define EFM_ADDR_SECTOR44           (0x00058000UL)   /*!< Sector 44 */
#define EFM_ADDR_SECTOR45           (0x0005A000UL)   /*!< Sector 45 */
#define EFM_ADDR_SECTOR46           (0x0005C000UL)   /*!< Sector 46 */
#define EFM_ADDR_SECTOR47           (0x0005E000UL)   /*!< Sector 47 */
#define EFM_ADDR_SECTOR48           (0x00060000UL)   /*!< Sector 48 */
#define EFM_ADDR_SECTOR49           (0x00062000UL)   /*!< Sector 49 */
#define EFM_ADDR_SECTOR50           (0x00064000UL)   /*!< Sector 50 */
#define EFM_ADDR_SECTOR51           (0x00066000UL)   /*!< Sector 51 */
#define EFM_ADDR_SECTOR52           (0x00068000UL)   /*!< Sector 52 */
#define EFM_ADDR_SECTOR53           (0x0006A000UL)   /*!< Sector 53 */
#define EFM_ADDR_SECTOR54           (0x0006C000UL)   /*!< Sector 54 */
#define EFM_ADDR_SECTOR55           (0x0006E000UL)   /*!< Sector 55 */
#define EFM_ADDR_SECTOR56           (0x00070000UL)   /*!< Sector 56 */
#define EFM_ADDR_SECTOR57           (0x00072000UL)   /*!< Sector 57 */
#define EFM_ADDR_SECTOR58           (0x00074000UL)   /*!< Sector 58 */
#define EFM_ADDR_SECTOR59           (0x00076000UL)   /*!< Sector 59 */
#define EFM_ADDR_SECTOR60           (0x00078000UL)   /*!< Sector 60 */
#define EFM_ADDR_SECTOR61           (0x0007A000UL)   /*!< Sector 61 */
#define EFM_ADDR_SECTOR62           (0x0007C000UL)   /*!< Sector 62 */
#define EFM_ADDR_SECTOR63           (0x0007E000UL)   /*!< Sector 63 */
#define EFM_ADDR_SECTOR64           (0x00080000UL)   /*!< Sector 64 */
#define EFM_ADDR_SECTOR65           (0x00082000UL)   /*!< Sector 65 */
#define EFM_ADDR_SECTOR66           (0x00084000UL)   /*!< Sector 66 */
#define EFM_ADDR_SECTOR67           (0x00086000UL)   /*!< Sector 67 */
#define EFM_ADDR_SECTOR68           (0x00088000UL)   /*!< Sector 68 */
#define EFM_ADDR_SECTOR69           (0x0008A000UL)   /*!< Sector 69 */
#define EFM_ADDR_SECTOR70           (0x0008C000UL)   /*!< Sector 70 */
#define EFM_ADDR_SECTOR71           (0x0008E000UL)   /*!< Sector 71 */
#define EFM_ADDR_SECTOR72           (0x00090000UL)   /*!< Sector 72 */
#define EFM_ADDR_SECTOR73           (0x00092000UL)   /*!< Sector 73 */
#define EFM_ADDR_SECTOR74           (0x00094000UL)   /*!< Sector 74 */
#define EFM_ADDR_SECTOR75           (0x00096000UL)   /*!< Sector 75 */
#define EFM_ADDR_SECTOR76           (0x00098000UL)   /*!< Sector 76 */
#define EFM_ADDR_SECTOR77           (0x0009A000UL)   /*!< Sector 77 */
#define EFM_ADDR_SECTOR78           (0x0009C000UL)   /*!< Sector 78 */
#define EFM_ADDR_SECTOR79           (0x0009E000UL)   /*!< Sector 79 */
#define EFM_ADDR_SECTOR80           (0x000A0000UL)   /*!< Sector 80 */
#define EFM_ADDR_SECTOR81           (0x000A2000UL)   /*!< Sector 81 */
#define EFM_ADDR_SECTOR82           (0x000A4000UL)   /*!< Sector 82 */
#define EFM_ADDR_SECTOR83           (0x000A6000UL)   /*!< Sector 83 */
#define EFM_ADDR_SECTOR84           (0x000A8000UL)   /*!< Sector 84 */
#define EFM_ADDR_SECTOR85           (0x000AA000UL)   /*!< Sector 85 */
#define EFM_ADDR_SECTOR86           (0x000AC000UL)   /*!< Sector 86 */
#define EFM_ADDR_SECTOR87           (0x000AE000UL)   /*!< Sector 87 */
#define EFM_ADDR_SECTOR88           (0x000B0000UL)   /*!< Sector 88 */
#define EFM_ADDR_SECTOR89           (0x000B2000UL)   /*!< Sector 89 */
#define EFM_ADDR_SECTOR90           (0x000B4000UL)   /*!< Sector 90 */
#define EFM_ADDR_SECTOR91           (0x000B6000UL)   /*!< Sector 91 */
#define EFM_ADDR_SECTOR92           (0x000B8000UL)   /*!< Sector 92 */
#define EFM_ADDR_SECTOR93           (0x000BA000UL)   /*!< Sector 93 */
#define EFM_ADDR_SECTOR94           (0x000BC000UL)   /*!< Sector 94 */
#define EFM_ADDR_SECTOR95           (0x000BE000UL)   /*!< Sector 95 */
#define EFM_ADDR_SECTOR96           (0x000C0000UL)   /*!< Sector 96 */
#define EFM_ADDR_SECTOR97           (0x000C2000UL)   /*!< Sector 97 */
#define EFM_ADDR_SECTOR98           (0x000C4000UL)   /*!< Sector 98 */
#define EFM_ADDR_SECTOR99           (0x000C6000UL)   /*!< Sector 99 */
#define EFM_ADDR_SECTOR100          (0x000C8000UL)   /*!< Sector 100 */
#define EFM_ADDR_SECTOR101          (0x000CA000UL)   /*!< Sector 101 */
#define EFM_ADDR_SECTOR102          (0x000CC000UL)   /*!< Sector 102 */
#define EFM_ADDR_SECTOR103          (0x000CE000UL)   /*!< Sector 103 */
#define EFM_ADDR_SECTOR104          (0x000D0000UL)   /*!< Sector 104 */
#define EFM_ADDR_SECTOR105          (0x000D2000UL)   /*!< Sector 105 */
#define EFM_ADDR_SECTOR106          (0x000D4000UL)   /*!< Sector 106 */
#define EFM_ADDR_SECTOR107          (0x000D6000UL)   /*!< Sector 107 */
#define EFM_ADDR_SECTOR108          (0x000D8000UL)   /*!< Sector 108 */
#define EFM_ADDR_SECTOR109          (0x000DA000UL)   /*!< Sector 109 */
#define EFM_ADDR_SECTOR110          (0x000DC000UL)   /*!< Sector 110 */
#define EFM_ADDR_SECTOR111          (0x000DE000UL)   /*!< Sector 111 */
#define EFM_ADDR_SECTOR112          (0x000E0000UL)   /*!< Sector 112 */
#define EFM_ADDR_SECTOR113          (0x000E2000UL)   /*!< Sector 113 */
#define EFM_ADDR_SECTOR114          (0x000E4000UL)   /*!< Sector 114 */
#define EFM_ADDR_SECTOR115          (0x000E6000UL)   /*!< Sector 115 */
#define EFM_ADDR_SECTOR116          (0x000E8000UL)   /*!< Sector 116 */
#define EFM_ADDR_SECTOR117          (0x000EA000UL)   /*!< Sector 117 */
#define EFM_ADDR_SECTOR118          (0x000EC000UL)   /*!< Sector 118 */
#define EFM_ADDR_SECTOR119          (0x000EE000UL)   /*!< Sector 119 */
#define EFM_ADDR_SECTOR120          (0x000F0000UL)   /*!< Sector 120 */
#define EFM_ADDR_SECTOR121          (0x000F2000UL)   /*!< Sector 121 */
#define EFM_ADDR_SECTOR122          (0x000F4000UL)   /*!< Sector 122 */
#define EFM_ADDR_SECTOR123          (0x000F6000UL)   /*!< Sector 123 */
#define EFM_ADDR_SECTOR124          (0x000F8000UL)   /*!< Sector 124 */
#define EFM_ADDR_SECTOR125          (0x000FA000UL)   /*!< Sector 125 */
#define EFM_ADDR_SECTOR126          (0x000FC000UL)   /*!< Sector 126 */
#define EFM_ADDR_SECTOR127          (0x000FE000UL)   /*!< Sector 127 */
#define EFM_ADDR_SECTOR128          (0x00100000UL)   /*!< Sector 128 */
#define EFM_ADDR_SECTOR129          (0x00102000UL)   /*!< Sector 129 */
#define EFM_ADDR_SECTOR130          (0x00104000UL)   /*!< Sector 130 */
#define EFM_ADDR_SECTOR131          (0x00106000UL)   /*!< Sector 131 */
#define EFM_ADDR_SECTOR132          (0x00108000UL)   /*!< Sector 132 */
#define EFM_ADDR_SECTOR133          (0x0010A000UL)   /*!< Sector 133 */
#define EFM_ADDR_SECTOR134          (0x0010C000UL)   /*!< Sector 134 */
#define EFM_ADDR_SECTOR135          (0x0010E000UL)   /*!< Sector 135 */
#define EFM_ADDR_SECTOR136          (0x00110000UL)   /*!< Sector 136 */
#define EFM_ADDR_SECTOR137          (0x00112000UL)   /*!< Sector 137 */
#define EFM_ADDR_SECTOR138          (0x00114000UL)   /*!< Sector 138 */
#define EFM_ADDR_SECTOR139          (0x00116000UL)   /*!< Sector 139 */
#define EFM_ADDR_SECTOR140          (0x00118000UL)   /*!< Sector 140 */
#define EFM_ADDR_SECTOR141          (0x0011A000UL)   /*!< Sector 141 */
#define EFM_ADDR_SECTOR142          (0x0011C000UL)   /*!< Sector 142 */
#define EFM_ADDR_SECTOR143          (0x0011E000UL)   /*!< Sector 143 */
#define EFM_ADDR_SECTOR144          (0x00120000UL)   /*!< Sector 144 */
#define EFM_ADDR_SECTOR145          (0x00122000UL)   /*!< Sector 145 */
#define EFM_ADDR_SECTOR146          (0x00124000UL)   /*!< Sector 146 */
#define EFM_ADDR_SECTOR147          (0x00126000UL)   /*!< Sector 147 */
#define EFM_ADDR_SECTOR148          (0x00128000UL)   /*!< Sector 148 */
#define EFM_ADDR_SECTOR149          (0x0012A000UL)   /*!< Sector 149 */
#define EFM_ADDR_SECTOR150          (0x0012C000UL)   /*!< Sector 150 */
#define EFM_ADDR_SECTOR151          (0x0012E000UL)   /*!< Sector 151 */
#define EFM_ADDR_SECTOR152          (0x00130000UL)   /*!< Sector 152 */
#define EFM_ADDR_SECTOR153          (0x00132000UL)   /*!< Sector 153 */
#define EFM_ADDR_SECTOR154          (0x00134000UL)   /*!< Sector 154 */
#define EFM_ADDR_SECTOR155          (0x00136000UL)   /*!< Sector 155 */
#define EFM_ADDR_SECTOR156          (0x00138000UL)   /*!< Sector 156 */
#define EFM_ADDR_SECTOR157          (0x0013A000UL)   /*!< Sector 157 */
#define EFM_ADDR_SECTOR158          (0x0013C000UL)   /*!< Sector 158 */
#define EFM_ADDR_SECTOR159          (0x0013E000UL)   /*!< Sector 159 */
#define EFM_ADDR_SECTOR160          (0x00140000UL)   /*!< Sector 160 */
#define EFM_ADDR_SECTOR161          (0x00142000UL)   /*!< Sector 161 */
#define EFM_ADDR_SECTOR162          (0x00144000UL)   /*!< Sector 162 */
#define EFM_ADDR_SECTOR163          (0x00146000UL)   /*!< Sector 163 */
#define EFM_ADDR_SECTOR164          (0x00148000UL)   /*!< Sector 164 */
#define EFM_ADDR_SECTOR165          (0x0014A000UL)   /*!< Sector 165 */
#define EFM_ADDR_SECTOR166          (0x0014C000UL)   /*!< Sector 166 */
#define EFM_ADDR_SECTOR167          (0x0014E000UL)   /*!< Sector 167 */
#define EFM_ADDR_SECTOR168          (0x00150000UL)   /*!< Sector 168 */
#define EFM_ADDR_SECTOR169          (0x00152000UL)   /*!< Sector 169 */
#define EFM_ADDR_SECTOR170          (0x00154000UL)   /*!< Sector 170 */
#define EFM_ADDR_SECTOR171          (0x00156000UL)   /*!< Sector 171 */
#define EFM_ADDR_SECTOR172          (0x00158000UL)   /*!< Sector 172 */
#define EFM_ADDR_SECTOR173          (0x0015A000UL)   /*!< Sector 173 */
#define EFM_ADDR_SECTOR174          (0x0015C000UL)   /*!< Sector 174 */
#define EFM_ADDR_SECTOR175          (0x0015E000UL)   /*!< Sector 175 */
#define EFM_ADDR_SECTOR176          (0x00160000UL)   /*!< Sector 176 */
#define EFM_ADDR_SECTOR177          (0x00162000UL)   /*!< Sector 177 */
#define EFM_ADDR_SECTOR178          (0x00164000UL)   /*!< Sector 178 */
#define EFM_ADDR_SECTOR179          (0x00166000UL)   /*!< Sector 179 */
#define EFM_ADDR_SECTOR180          (0x00168000UL)   /*!< Sector 180 */
#define EFM_ADDR_SECTOR181          (0x0016A000UL)   /*!< Sector 181 */
#define EFM_ADDR_SECTOR182          (0x0016C000UL)   /*!< Sector 182 */
#define EFM_ADDR_SECTOR183          (0x0016E000UL)   /*!< Sector 183 */
#define EFM_ADDR_SECTOR184          (0x00170000UL)   /*!< Sector 184 */
#define EFM_ADDR_SECTOR185          (0x00172000UL)   /*!< Sector 185 */
#define EFM_ADDR_SECTOR186          (0x00174000UL)   /*!< Sector 186 */
#define EFM_ADDR_SECTOR187          (0x00176000UL)   /*!< Sector 187 */
#define EFM_ADDR_SECTOR188          (0x00178000UL)   /*!< Sector 188 */
#define EFM_ADDR_SECTOR189          (0x0017A000UL)   /*!< Sector 189 */
#define EFM_ADDR_SECTOR190          (0x0017C000UL)   /*!< Sector 190 */
#define EFM_ADDR_SECTOR191          (0x0017E000UL)   /*!< Sector 191 */
#define EFM_ADDR_SECTOR192          (0x00180000UL)   /*!< Sector 192 */
#define EFM_ADDR_SECTOR193          (0x00182000UL)   /*!< Sector 193 */
#define EFM_ADDR_SECTOR194          (0x00184000UL)   /*!< Sector 194 */
#define EFM_ADDR_SECTOR195          (0x00186000UL)   /*!< Sector 195 */
#define EFM_ADDR_SECTOR196          (0x00188000UL)   /*!< Sector 196 */
#define EFM_ADDR_SECTOR197          (0x0018A000UL)   /*!< Sector 197 */
#define EFM_ADDR_SECTOR198          (0x0018C000UL)   /*!< Sector 198 */
#define EFM_ADDR_SECTOR199          (0x0018E000UL)   /*!< Sector 199 */
#define EFM_ADDR_SECTOR200          (0x00190000UL)   /*!< Sector 200 */
#define EFM_ADDR_SECTOR201          (0x00192000UL)   /*!< Sector 201 */
#define EFM_ADDR_SECTOR202          (0x00194000UL)   /*!< Sector 202 */
#define EFM_ADDR_SECTOR203          (0x00196000UL)   /*!< Sector 203 */
#define EFM_ADDR_SECTOR204          (0x00198000UL)   /*!< Sector 204 */
#define EFM_ADDR_SECTOR205          (0x0019A000UL)   /*!< Sector 205 */
#define EFM_ADDR_SECTOR206          (0x0019C000UL)   /*!< Sector 206 */
#define EFM_ADDR_SECTOR207          (0x0019E000UL)   /*!< Sector 207 */
#define EFM_ADDR_SECTOR208          (0x001A0000UL)   /*!< Sector 208 */
#define EFM_ADDR_SECTOR209          (0x001A2000UL)   /*!< Sector 209 */
#define EFM_ADDR_SECTOR210          (0x001A4000UL)   /*!< Sector 210 */
#define EFM_ADDR_SECTOR211          (0x001A6000UL)   /*!< Sector 211 */
#define EFM_ADDR_SECTOR212          (0x001A8000UL)   /*!< Sector 212 */
#define EFM_ADDR_SECTOR213          (0x001AA000UL)   /*!< Sector 213 */
#define EFM_ADDR_SECTOR214          (0x001AC000UL)   /*!< Sector 214 */
#define EFM_ADDR_SECTOR215          (0x001AE000UL)   /*!< Sector 215 */
#define EFM_ADDR_SECTOR216          (0x001B0000UL)   /*!< Sector 216 */
#define EFM_ADDR_SECTOR217          (0x001B2000UL)   /*!< Sector 217 */
#define EFM_ADDR_SECTOR218          (0x001B4000UL)   /*!< Sector 218 */
#define EFM_ADDR_SECTOR219          (0x001B6000UL)   /*!< Sector 219 */
#define EFM_ADDR_SECTOR220          (0x001B8000UL)   /*!< Sector 220 */
#define EFM_ADDR_SECTOR221          (0x001BA000UL)   /*!< Sector 221 */
#define EFM_ADDR_SECTOR222          (0x001BC000UL)   /*!< Sector 222 */
#define EFM_ADDR_SECTOR223          (0x001BE000UL)   /*!< Sector 223 */
#define EFM_ADDR_SECTOR224          (0x001C0000UL)   /*!< Sector 224 */
#define EFM_ADDR_SECTOR225          (0x001C2000UL)   /*!< Sector 225 */
#define EFM_ADDR_SECTOR226          (0x001C4000UL)   /*!< Sector 226 */
#define EFM_ADDR_SECTOR227          (0x001C6000UL)   /*!< Sector 227 */
#define EFM_ADDR_SECTOR228          (0x001C8000UL)   /*!< Sector 228 */
#define EFM_ADDR_SECTOR229          (0x001CA000UL)   /*!< Sector 229 */
#define EFM_ADDR_SECTOR230          (0x001CC000UL)   /*!< Sector 230 */
#define EFM_ADDR_SECTOR231          (0x001CE000UL)   /*!< Sector 231 */
#define EFM_ADDR_SECTOR232          (0x001D0000UL)   /*!< Sector 232 */
#define EFM_ADDR_SECTOR233          (0x001D2000UL)   /*!< Sector 233 */
#define EFM_ADDR_SECTOR234          (0x001D4000UL)   /*!< Sector 234 */
#define EFM_ADDR_SECTOR235          (0x001D6000UL)   /*!< Sector 235 */
#define EFM_ADDR_SECTOR236          (0x001D8000UL)   /*!< Sector 236 */
#define EFM_ADDR_SECTOR237          (0x001DA000UL)   /*!< Sector 237 */
#define EFM_ADDR_SECTOR238          (0x001DC000UL)   /*!< Sector 238 */
#define EFM_ADDR_SECTOR239          (0x001DE000UL)   /*!< Sector 239 */
#define EFM_ADDR_SECTOR240          (0x001E0000UL)   /*!< Sector 240 */
#define EFM_ADDR_SECTOR241          (0x001E2000UL)   /*!< Sector 241 */
#define EFM_ADDR_SECTOR242          (0x001E4000UL)   /*!< Sector 242 */
#define EFM_ADDR_SECTOR243          (0x001E6000UL)   /*!< Sector 243 */
#define EFM_ADDR_SECTOR244          (0x001E8000UL)   /*!< Sector 244 */
#define EFM_ADDR_SECTOR245          (0x001EA000UL)   /*!< Sector 245 */
#define EFM_ADDR_SECTOR246          (0x001EC000UL)   /*!< Sector 246 */
#define EFM_ADDR_SECTOR247          (0x001EE000UL)   /*!< Sector 247 */
#define EFM_ADDR_SECTOR248          (0x001F0000UL)   /*!< Sector 248 */
#define EFM_ADDR_SECTOR249          (0x001F2000UL)   /*!< Sector 249 */
#define EFM_ADDR_SECTOR250          (0x001F4000UL)   /*!< Sector 250 */
#define EFM_ADDR_SECTOR251          (0x001F6000UL)   /*!< Sector 251 */
#define EFM_ADDR_SECTOR252          (0x001F8000UL)   /*!< Sector 252 */
#define EFM_ADDR_SECTOR253          (0x001FA000UL)   /*!< Sector 253 */
#define EFM_ADDR_SECTOR254          (0x001FC000UL)   /*!< Sector 254 */
#define EFM_ADDR_SECTOR255          (0x001FE000UL)   /*!< Sector 255 */
/**
 * @}
 */

