RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_efm.h
/**
 * @defgroup EFM_OTP_Address EFM otp address
 * @{
 */
#define EFM_OTP_BLOCK0              (0x00000000UL)   /*!< OTP block0   8K Bytes */
#define EFM_OTP_BLOCK1              (0x00002000UL)   /*!< OTP block1   8K Bytes */
#define EFM_OTP_BLOCK2              (0x00004000UL)   /*!< OTP block2   8K Bytes */
#define EFM_OTP_BLOCK3              (0x00006000UL)   /*!< OTP block3   8K Bytes */
#define EFM_OTP_BLOCK4              (0x00008000UL)   /*!< OTP block4   8K Bytes */
#define EFM_OTP_BLOCK5              (0x0000A000UL)   /*!< OTP block5   8K Bytes */
#define EFM_OTP_BLOCK6              (0x0000C000UL)   /*!< OTP block6   8K Bytes */
#define EFM_OTP_BLOCK7              (0x0000E000UL)   /*!< OTP block7   8K Bytes */
#define EFM_OTP_BLOCK8              (0x00010000UL)   /*!< OTP block8   8K Bytes */
#define EFM_OTP_BLOCK9              (0x00012000UL)   /*!< OTP block9   8K Bytes */
#define EFM_OTP_BLOCK10             (0x00014000UL)   /*!< OTP block10  8K Bytes */
#define EFM_OTP_BLOCK11             (0x00016000UL)   /*!< OTP block11  8K Bytes */
#define EFM_OTP_BLOCK12             (0x00018000UL)   /*!< OTP block12  8K Bytes */
#define EFM_OTP_BLOCK13             (0x0001A000UL)   /*!< OTP block13  8K Bytes */
#define EFM_OTP_BLOCK14             (0x0001C000UL)   /*!< OTP block14  8K Bytes */
#define EFM_OTP_BLOCK15             (0x0001E000UL)   /*!< OTP block15  8K Bytes */

#define EFM_OTP_BLOCK16             (0x03000000UL)   /*!< OTP block16  2K Bytes */
#define EFM_OTP_BLOCK17             (0x03000800UL)   /*!< OTP block17  2K Bytes */

#define EFM_OTP_BLOCK18             (0x03001000UL)   /*!< OTP block18  256 Bytes */
#define EFM_OTP_BLOCK19             (0x03001100UL)   /*!< OTP block19  256 Bytes */
#define EFM_OTP_BLOCK20             (0x03001200UL)   /*!< OTP block20  256 Bytes */
#define EFM_OTP_BLOCK21             (0x03001300UL)   /*!< OTP block21  256 Bytes */

#define EFM_OTP_BLOCK22             (0x03001400UL)   /*!< OTP block22  16 Bytes */
#define EFM_OTP_BLOCK23             (0x03001410UL)   /*!< OTP block23  16 Bytes */
#define EFM_OTP_BLOCK24             (0x03001420UL)   /*!< OTP block24  16 Bytes */
#define EFM_OTP_BLOCK25             (0x03001430UL)   /*!< OTP block25  16 Bytes */
#define EFM_OTP_BLOCK26             (0x03001440UL)   /*!< OTP block26  16 Bytes */
#define EFM_OTP_BLOCK27             (0x03001450UL)   /*!< OTP block27  16 Bytes */
#define EFM_OTP_BLOCK28             (0x03001460UL)   /*!< OTP block28  16 Bytes */
#define EFM_OTP_BLOCK29             (0x03001470UL)   /*!< OTP block29  16 Bytes */
#define EFM_OTP_BLOCK30             (0x03001480UL)   /*!< OTP block30  16 Bytes */
#define EFM_OTP_BLOCK31             (0x03001490UL)   /*!< OTP block31  16 Bytes */
#define EFM_OTP_BLOCK32             (0x030014A0UL)   /*!< OTP block32  16 Bytes */
#define EFM_OTP_BLOCK33             (0x030014B0UL)   /*!< OTP block33  16 Bytes */
#define EFM_OTP_BLOCK34             (0x030014C0UL)   /*!< OTP block34  16 Bytes */
#define EFM_OTP_BLOCK35             (0x030014D0UL)   /*!< OTP block35  16 Bytes */
#define EFM_OTP_BLOCK36             (0x030014E0UL)   /*!< OTP block36  16 Bytes */
#define EFM_OTP_BLOCK37             (0x030014F0UL)   /*!< OTP block37  16 Bytes */
#define EFM_OTP_BLOCK38             (0x03001500UL)   /*!< OTP block38  16 Bytes */
#define EFM_OTP_BLOCK39             (0x03001510UL)   /*!< OTP block39  16 Bytes */
#define EFM_OTP_BLOCK40             (0x03001520UL)   /*!< OTP block40  16 Bytes */
#define EFM_OTP_BLOCK41             (0x03001530UL)   /*!< OTP block41  16 Bytes */
#define EFM_OTP_BLOCK42             (0x03001540UL)   /*!< OTP block42  16 Bytes */
#define EFM_OTP_BLOCK43             (0x03001550UL)   /*!< OTP block43  16 Bytes */
#define EFM_OTP_BLOCK44             (0x03001560UL)   /*!< OTP block44  16 Bytes */
#define EFM_OTP_BLOCK45             (0x03001570UL)   /*!< OTP block45  16 Bytes */
#define EFM_OTP_BLOCK46             (0x03001580UL)   /*!< OTP block46  16 Bytes */
#define EFM_OTP_BLOCK47             (0x03001590UL)   /*!< OTP block47  16 Bytes */
#define EFM_OTP_BLOCK48             (0x030015A0UL)   /*!< OTP block48  16 Bytes */
#define EFM_OTP_BLOCK49             (0x030015B0UL)   /*!< OTP block49  16 Bytes */
#define EFM_OTP_BLOCK50             (0x030015C0UL)   /*!< OTP block50  16 Bytes */
#define EFM_OTP_BLOCK51             (0x030015D0UL)   /*!< OTP block51  16 Bytes */
#define EFM_OTP_BLOCK52             (0x030015E0UL)   /*!< OTP block52  16 Bytes */
#define EFM_OTP_BLOCK53             (0x030015F0UL)   /*!< OTP block53  16 Bytes */

#define EFM_OTP_BLOCK54             (0x03001600UL)   /*!< OTP block54  4 Bytes */
#define EFM_OTP_BLOCK55             (0x03001604UL)   /*!< OTP block55  4 Bytes */
#define EFM_OTP_BLOCK56             (0x03001608UL)   /*!< OTP block56  4 Bytes */
#define EFM_OTP_BLOCK57             (0x0300160CUL)   /*!< OTP block57  4 Bytes */
#define EFM_OTP_BLOCK58             (0x03001610UL)   /*!< OTP block58  4 Bytes */
#define EFM_OTP_BLOCK59             (0x03001614UL)   /*!< OTP block59  4 Bytes */
#define EFM_OTP_BLOCK60             (0x03001618UL)   /*!< OTP block60  4 Bytes */
#define EFM_OTP_BLOCK61             (0x0300161CUL)   /*!< OTP block61  4 Bytes */
#define EFM_OTP_BLOCK62             (0x03001620UL)   /*!< OTP block62  4 Bytes */
#define EFM_OTP_BLOCK63             (0x03001624UL)   /*!< OTP block63  4 Bytes */
#define EFM_OTP_BLOCK64             (0x03001628UL)   /*!< OTP block64  4 Bytes */
#define EFM_OTP_BLOCK65             (0x0300162CUL)   /*!< OTP block65  4 Bytes */
#define EFM_OTP_BLOCK66             (0x03001630UL)   /*!< OTP block66  4 Bytes */
#define EFM_OTP_BLOCK67             (0x03001634UL)   /*!< OTP block67  4 Bytes */
#define EFM_OTP_BLOCK68             (0x03001638UL)   /*!< OTP block68  4 Bytes */
#define EFM_OTP_BLOCK69             (0x0300163CUL)   /*!< OTP block69  4 Bytes */
#define EFM_OTP_BLOCK70             (0x03001640UL)   /*!< OTP block70  4 Bytes */
#define EFM_OTP_BLOCK71             (0x03001644UL)   /*!< OTP block71  4 Bytes */
#define EFM_OTP_BLOCK72             (0x03001648UL)   /*!< OTP block72  4 Bytes */
#define EFM_OTP_BLOCK73             (0x0300164CUL)   /*!< OTP block73  4 Bytes */
#define EFM_OTP_BLOCK74             (0x03001650UL)   /*!< OTP block74  4 Bytes */
#define EFM_OTP_BLOCK75             (0x03001654UL)   /*!< OTP block75  4 Bytes */
#define EFM_OTP_BLOCK76             (0x03001658UL)   /*!< OTP block76  4 Bytes */
#define EFM_OTP_BLOCK77             (0x0300165CUL)   /*!< OTP block77  4 Bytes */
#define EFM_OTP_BLOCK78             (0x03001660UL)   /*!< OTP block78  4 Bytes */
#define EFM_OTP_BLOCK79             (0x03001664UL)   /*!< OTP block79  4 Bytes */
#define EFM_OTP_BLOCK80             (0x03001668UL)   /*!< OTP block80  4 Bytes */
#define EFM_OTP_BLOCK81             (0x0300166CUL)   /*!< OTP block81  4 Bytes */
#define EFM_OTP_BLOCK82             (0x03001670UL)   /*!< OTP block82  4 Bytes */
#define EFM_OTP_BLOCK83             (0x03001674UL)   /*!< OTP block83  4 Bytes */
#define EFM_OTP_BLOCK84             (0x03001678UL)   /*!< OTP block84  4 Bytes */
#define EFM_OTP_BLOCK85             (0x0300167CUL)   /*!< OTP block85  4 Bytes */
#define EFM_OTP_BLOCK86             (0x03001680UL)   /*!< OTP block86  4 Bytes */
#define EFM_OTP_BLOCK87             (0x03001684UL)   /*!< OTP block87  4 Bytes */
#define EFM_OTP_BLOCK88             (0x03001688UL)   /*!< OTP block88  4 Bytes */
#define EFM_OTP_BLOCK89             (0x0300168CUL)   /*!< OTP block89  4 Bytes */
#define EFM_OTP_BLOCK90             (0x03001690UL)   /*!< OTP block90  4 Bytes */
#define EFM_OTP_BLOCK91             (0x03001694UL)   /*!< OTP block91  4 Bytes */
#define EFM_OTP_BLOCK92             (0x03001698UL)   /*!< OTP block92  4 Bytes */
#define EFM_OTP_BLOCK93             (0x0300169CUL)   /*!< OTP block93  4 Bytes */
#define EFM_OTP_BLOCK94             (0x030016A0UL)   /*!< OTP block94  4 Bytes */
#define EFM_OTP_BLOCK95             (0x030016A4UL)   /*!< OTP block95  4 Bytes */
#define EFM_OTP_BLOCK96             (0x030016A8UL)   /*!< OTP block96  4 Bytes */
#define EFM_OTP_BLOCK97             (0x030016ACUL)   /*!< OTP block97  4 Bytes */
#define EFM_OTP_BLOCK98             (0x030016B0UL)   /*!< OTP block98  4 Bytes */
#define EFM_OTP_BLOCK99             (0x030016B4UL)   /*!< OTP block99  4 Bytes */
#define EFM_OTP_BLOCK100            (0x030016B8UL)   /*!< OTP block100 4 Bytes */
#define EFM_OTP_BLOCK101            (0x030016BCUL)   /*!< OTP block101 4 Bytes */
#define EFM_OTP_BLOCK102            (0x030016C0UL)   /*!< OTP block102 4 Bytes */
#define EFM_OTP_BLOCK103            (0x030016C4UL)   /*!< OTP block103 4 Bytes */
#define EFM_OTP_BLOCK104            (0x030016C8UL)   /*!< OTP block104 4 Bytes */
#define EFM_OTP_BLOCK105            (0x030016CCUL)   /*!< OTP block105 4 Bytes */
#define EFM_OTP_BLOCK106            (0x030016D0UL)   /*!< OTP block106 4 Bytes */
#define EFM_OTP_BLOCK107            (0x030016D4UL)   /*!< OTP block107 4 Bytes */
#define EFM_OTP_BLOCK108            (0x030016D8UL)   /*!< OTP block108 4 Bytes */
#define EFM_OTP_BLOCK109            (0x030016DCUL)   /*!< OTP block109 4 Bytes */
#define EFM_OTP_BLOCK110            (0x030016E0UL)   /*!< OTP block110 4 Bytes */
#define EFM_OTP_BLOCK111            (0x030016E4UL)   /*!< OTP block111 4 Bytes */
#define EFM_OTP_BLOCK112            (0x030016E8UL)   /*!< OTP block112 4 Bytes */
#define EFM_OTP_BLOCK113            (0x030016ECUL)   /*!< OTP block113 4 Bytes */
#define EFM_OTP_BLOCK114            (0x030016F0UL)   /*!< OTP block114 4 Bytes */
#define EFM_OTP_BLOCK115            (0x030016F4UL)   /*!< OTP block115 4 Bytes */
#define EFM_OTP_BLOCK116            (0x030016F8UL)   /*!< OTP block116 4 Bytes */
#define EFM_OTP_BLOCK117            (0x030016FCUL)   /*!< OTP block117 4 Bytes */
#define EFM_OTP_BLOCK118            (0x03001700UL)   /*!< OTP block118 4 Bytes */
#define EFM_OTP_BLOCK119            (0x03001704UL)   /*!< OTP block119 4 Bytes */
#define EFM_OTP_BLOCK120            (0x03001708UL)   /*!< OTP block120 4 Bytes */
#define EFM_OTP_BLOCK121            (0x0300170CUL)   /*!< OTP block121 4 Bytes */
#define EFM_OTP_BLOCK122            (0x03001710UL)   /*!< OTP block122 4 Bytes */
#define EFM_OTP_BLOCK123            (0x03001714UL)   /*!< OTP block123 4 Bytes */
#define EFM_OTP_BLOCK124            (0x03001718UL)   /*!< OTP block124 4 Bytes */
#define EFM_OTP_BLOCK125            (0x0300171CUL)   /*!< OTP block125 4 Bytes */
#define EFM_OTP_BLOCK126            (0x03001720UL)   /*!< OTP block126 4 Bytes */
#define EFM_OTP_BLOCK127            (0x03001724UL)   /*!< OTP block127 4 Bytes */
#define EFM_OTP_BLOCK128            (0x03001728UL)   /*!< OTP block128 4 Bytes */
#define EFM_OTP_BLOCK129            (0x0300172CUL)   /*!< OTP block129 4 Bytes */
#define EFM_OTP_BLOCK130            (0x03001730UL)   /*!< OTP block130 4 Bytes */
#define EFM_OTP_BLOCK131            (0x03001734UL)   /*!< OTP block131 4 Bytes */
#define EFM_OTP_BLOCK132            (0x03001738UL)   /*!< OTP block132 4 Bytes */
#define EFM_OTP_BLOCK133            (0x0300173CUL)   /*!< OTP block133 4 Bytes */
#define EFM_OTP_BLOCK134            (0x03001740UL)   /*!< OTP block134 4 Bytes */
#define EFM_OTP_BLOCK135            (0x03001744UL)   /*!< OTP block135 4 Bytes */
#define EFM_OTP_BLOCK136            (0x03001748UL)   /*!< OTP block136 4 Bytes */
#define EFM_OTP_BLOCK137            (0x0300174CUL)   /*!< OTP block137 4 Bytes */
#define EFM_OTP_BLOCK138            (0x03001750UL)   /*!< OTP block138 4 Bytes */
#define EFM_OTP_BLOCK139            (0x03001754UL)   /*!< OTP block139 4 Bytes */
#define EFM_OTP_BLOCK140            (0x03001758UL)   /*!< OTP block140 4 Bytes */
#define EFM_OTP_BLOCK141            (0x0300175CUL)   /*!< OTP block141 4 Bytes */
#define EFM_OTP_BLOCK142            (0x03001760UL)   /*!< OTP block142 4 Bytes */
#define EFM_OTP_BLOCK143            (0x03001764UL)   /*!< OTP block143 4 Bytes */
#define EFM_OTP_BLOCK144            (0x03001768UL)   /*!< OTP block144 4 Bytes */
#define EFM_OTP_BLOCK145            (0x0300176CUL)   /*!< OTP block145 4 Bytes */
#define EFM_OTP_BLOCK146            (0x03001770UL)   /*!< OTP block146 4 Bytes */
#define EFM_OTP_BLOCK147            (0x03001774UL)   /*!< OTP block147 4 Bytes */
#define EFM_OTP_BLOCK148            (0x03001778UL)   /*!< OTP block148 4 Bytes */
#define EFM_OTP_BLOCK149            (0x0300177CUL)   /*!< OTP block149 4 Bytes */
#define EFM_OTP_BLOCK150            (0x03001780UL)   /*!< OTP block150 4 Bytes */
#define EFM_OTP_BLOCK151            (0x03001784UL)   /*!< OTP block151 4 Bytes */
#define EFM_OTP_BLOCK152            (0x03001788UL)   /*!< OTP block152 4 Bytes */
#define EFM_OTP_BLOCK153            (0x0300178CUL)   /*!< OTP block153 4 Bytes */
#define EFM_OTP_BLOCK154            (0x03001790UL)   /*!< OTP block154 4 Bytes */
#define EFM_OTP_BLOCK155            (0x03001794UL)   /*!< OTP block155 4 Bytes */
#define EFM_OTP_BLOCK156            (0x03001798UL)   /*!< OTP block156 4 Bytes */
#define EFM_OTP_BLOCK157            (0x0300179CUL)   /*!< OTP block157 4 Bytes */
#define EFM_OTP_BLOCK158            (0x030017A0UL)   /*!< OTP block158 4 Bytes */
#define EFM_OTP_BLOCK159            (0x030017A4UL)   /*!< OTP block159 4 Bytes */
#define EFM_OTP_BLOCK160            (0x030017A8UL)   /*!< OTP block160 4 Bytes */
#define EFM_OTP_BLOCK161            (0x030017ACUL)   /*!< OTP block161 4 Bytes */
#define EFM_OTP_BLOCK162            (0x030017B0UL)   /*!< OTP block162 4 Bytes */
#define EFM_OTP_BLOCK163            (0x030017B4UL)   /*!< OTP block163 4 Bytes */
#define EFM_OTP_BLOCK164            (0x030017B8UL)   /*!< OTP block164 4 Bytes */
#define EFM_OTP_BLOCK165            (0x030017BCUL)   /*!< OTP block165 4 Bytes */
#define EFM_OTP_BLOCK166            (0x030017C0UL)   /*!< OTP block166 4 Bytes */
#define EFM_OTP_BLOCK167            (0x030017C4UL)   /*!< OTP block167 4 Bytes */
#define EFM_OTP_BLOCK168            (0x030017C8UL)   /*!< OTP block168 4 Bytes */
#define EFM_OTP_BLOCK169            (0x030017CCUL)   /*!< OTP block169 4 Bytes */
#define EFM_OTP_BLOCK170            (0x030017D0UL)   /*!< OTP block170 4 Bytes */
#define EFM_OTP_BLOCK171            (0x030017D4UL)   /*!< OTP block171 4 Bytes */
#define EFM_OTP_BLOCK172            (0x030017D8UL)   /*!< OTP block172 4 Bytes */
#define EFM_OTP_BLOCK173            (0x030017DCUL)   /*!< OTP block173 4 Bytes */
#define EFM_OTP_BLOCK174            (0x030017E0UL)   /*!< OTP block174 4 Bytes */
#define EFM_OTP_BLOCK175            (0x030017E4UL)   /*!< OTP block175 4 Bytes */
#define EFM_OTP_BLOCK176            (0x030017E8UL)   /*!< OTP block176 4 Bytes */
#define EFM_OTP_BLOCK177            (0x030017ECUL)   /*!< OTP block177 4 Bytes */
#define EFM_OTP_BLOCK178            (0x030017F0UL)   /*!< OTP block178 4 Bytes */
#define EFM_OTP_BLOCK179            (0x030017F4UL)   /*!< OTP block179 4 Bytes */
#define EFM_OTP_BLOCK180            (0x030017F8UL)   /*!< OTP block180 4 Bytes */
#define EFM_OTP_BLOCK181            (0x030017FCUL)   /*!< OTP block181 4 Bytes */
/**
 * @}
 */

