RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_efm.h
/**
 * @defgroup EFM_Sectot_Num Efm sector number
 * @{
 */
#define EFM_SECTOR_0                (0U)
#define EFM_SECTOR_1                (1U)
#define EFM_SECTOR_2                (2U)
#define EFM_SECTOR_3                (3U)
#define EFM_SECTOR_4                (4U)
#define EFM_SECTOR_5                (5U)
#define EFM_SECTOR_6                (6U)
#define EFM_SECTOR_7                (7U)
#define EFM_SECTOR_8                (8U)
#define EFM_SECTOR_9                (9U)
#define EFM_SECTOR_10               (10U)
#define EFM_SECTOR_11               (11U)
#define EFM_SECTOR_12               (12U)
#define EFM_SECTOR_13               (13U)
#define EFM_SECTOR_14               (14U)
#define EFM_SECTOR_15               (15U)
#define EFM_SECTOR_16               (16U)
#define EFM_SECTOR_17               (17U)
#define EFM_SECTOR_18               (18U)
#define EFM_SECTOR_19               (19U)
#define EFM_SECTOR_20               (20U)
#define EFM_SECTOR_21               (21U)
#define EFM_SECTOR_22               (22U)
#define EFM_SECTOR_23               (23U)
#define EFM_SECTOR_24               (24U)
#define EFM_SECTOR_25               (25U)
#define EFM_SECTOR_26               (26U)
#define EFM_SECTOR_27               (27U)
#define EFM_SECTOR_28               (28U)
#define EFM_SECTOR_29               (29U)
#define EFM_SECTOR_30               (30U)
#define EFM_SECTOR_31               (31U)
#define EFM_SECTOR_32               (32U)
#define EFM_SECTOR_33               (33U)
#define EFM_SECTOR_34               (34U)
#define EFM_SECTOR_35               (35U)
#define EFM_SECTOR_36               (36U)
#define EFM_SECTOR_37               (37U)
#define EFM_SECTOR_38               (38U)
#define EFM_SECTOR_39               (39U)
#define EFM_SECTOR_40               (40U)
#define EFM_SECTOR_41               (41U)
#define EFM_SECTOR_42               (42U)
#define EFM_SECTOR_43               (43U)
#define EFM_SECTOR_44               (44U)
#define EFM_SECTOR_45               (45U)
#define EFM_SECTOR_46               (46U)
#define EFM_SECTOR_47               (47U)
#define EFM_SECTOR_48               (48U)
#define EFM_SECTOR_49               (49U)
#define EFM_SECTOR_50               (50U)
#define EFM_SECTOR_51               (51U)
#define EFM_SECTOR_52               (52U)
#define EFM_SECTOR_53               (53U)
#define EFM_SECTOR_54               (54U)
#define EFM_SECTOR_55               (55U)
#define EFM_SECTOR_56               (56U)
#define EFM_SECTOR_57               (57U)
#define EFM_SECTOR_58               (58U)
#define EFM_SECTOR_59               (59U)
#define EFM_SECTOR_60               (60U)
#define EFM_SECTOR_61               (61U)
#define EFM_SECTOR_62               (62U)
#define EFM_SECTOR_63               (63U)
#define EFM_SECTOR_64               (64U)
#define EFM_SECTOR_65               (65U)
#define EFM_SECTOR_66               (66U)
#define EFM_SECTOR_67               (67U)
#define EFM_SECTOR_68               (68U)
#define EFM_SECTOR_69               (69U)
#define EFM_SECTOR_70               (70U)
#define EFM_SECTOR_71               (71U)
#define EFM_SECTOR_72               (72U)
#define EFM_SECTOR_73               (73U)
#define EFM_SECTOR_74               (74U)
#define EFM_SECTOR_75               (75U)
#define EFM_SECTOR_76               (76U)
#define EFM_SECTOR_77               (77U)
#define EFM_SECTOR_78               (78U)
#define EFM_SECTOR_79               (79U)
#define EFM_SECTOR_80               (80U)
#define EFM_SECTOR_81               (81U)
#define EFM_SECTOR_82               (82U)
#define EFM_SECTOR_83               (83U)
#define EFM_SECTOR_84               (84U)
#define EFM_SECTOR_85               (85U)
#define EFM_SECTOR_86               (86U)
#define EFM_SECTOR_87               (87U)
#define EFM_SECTOR_88               (88U)
#define EFM_SECTOR_89               (89U)
#define EFM_SECTOR_90               (90U)
#define EFM_SECTOR_91               (91U)
#define EFM_SECTOR_92               (92U)
#define EFM_SECTOR_93               (93U)
#define EFM_SECTOR_94               (94U)
#define EFM_SECTOR_95               (95U)
#define EFM_SECTOR_96               (96U)
#define EFM_SECTOR_97               (97U)
#define EFM_SECTOR_98               (98U)
#define EFM_SECTOR_99               (99U)
#define EFM_SECTOR_100              (100U)
#define EFM_SECTOR_101              (101U)
#define EFM_SECTOR_102              (102U)
#define EFM_SECTOR_103              (103U)
#define EFM_SECTOR_104              (104U)
#define EFM_SECTOR_105              (105U)
#define EFM_SECTOR_106              (106U)
#define EFM_SECTOR_107              (107U)
#define EFM_SECTOR_108              (108U)
#define EFM_SECTOR_109              (109U)
#define EFM_SECTOR_110              (110U)
#define EFM_SECTOR_111              (111U)
#define EFM_SECTOR_112              (112U)
#define EFM_SECTOR_113              (113U)
#define EFM_SECTOR_114              (114U)
#define EFM_SECTOR_115              (115U)
#define EFM_SECTOR_116              (116U)
#define EFM_SECTOR_117              (117U)
#define EFM_SECTOR_118              (118U)
#define EFM_SECTOR_119              (119U)
#define EFM_SECTOR_120              (120U)
#define EFM_SECTOR_121              (121U)
#define EFM_SECTOR_122              (122U)
#define EFM_SECTOR_123              (123U)
#define EFM_SECTOR_124              (124U)
#define EFM_SECTOR_125              (125U)
#define EFM_SECTOR_126              (126U)
#define EFM_SECTOR_127              (127U)
#define EFM_SECTOR_128              (128U)
#define EFM_SECTOR_129              (129U)
#define EFM_SECTOR_130              (130U)
#define EFM_SECTOR_131              (131U)
#define EFM_SECTOR_132              (132U)
#define EFM_SECTOR_133              (133U)
#define EFM_SECTOR_134              (134U)
#define EFM_SECTOR_135              (135U)
#define EFM_SECTOR_136              (136U)
#define EFM_SECTOR_137              (137U)
#define EFM_SECTOR_138              (138U)
#define EFM_SECTOR_139              (139U)
#define EFM_SECTOR_140              (140U)
#define EFM_SECTOR_141              (141U)
#define EFM_SECTOR_142              (142U)
#define EFM_SECTOR_143              (143U)
#define EFM_SECTOR_144              (144U)
#define EFM_SECTOR_145              (145U)
#define EFM_SECTOR_146              (146U)
#define EFM_SECTOR_147              (147U)
#define EFM_SECTOR_148              (148U)
#define EFM_SECTOR_149              (149U)
#define EFM_SECTOR_150              (150U)
#define EFM_SECTOR_151              (151U)
#define EFM_SECTOR_152              (152U)
#define EFM_SECTOR_153              (153U)
#define EFM_SECTOR_154              (154U)
#define EFM_SECTOR_155              (155U)
#define EFM_SECTOR_156              (156U)
#define EFM_SECTOR_157              (157U)
#define EFM_SECTOR_158              (158U)
#define EFM_SECTOR_159              (159U)
#define EFM_SECTOR_160              (160U)
#define EFM_SECTOR_161              (161U)
#define EFM_SECTOR_162              (162U)
#define EFM_SECTOR_163              (163U)
#define EFM_SECTOR_164              (164U)
#define EFM_SECTOR_165              (165U)
#define EFM_SECTOR_166              (166U)
#define EFM_SECTOR_167              (167U)
#define EFM_SECTOR_168              (168U)
#define EFM_SECTOR_169              (169U)
#define EFM_SECTOR_170              (170U)
#define EFM_SECTOR_171              (171U)
#define EFM_SECTOR_172              (172U)
#define EFM_SECTOR_173              (173U)
#define EFM_SECTOR_174              (174U)
#define EFM_SECTOR_175              (175U)
#define EFM_SECTOR_176              (176U)
#define EFM_SECTOR_177              (177U)
#define EFM_SECTOR_178              (178U)
#define EFM_SECTOR_179              (179U)
#define EFM_SECTOR_180              (180U)
#define EFM_SECTOR_181              (181U)
#define EFM_SECTOR_182              (182U)
#define EFM_SECTOR_183              (183U)
#define EFM_SECTOR_184              (184U)
#define EFM_SECTOR_185              (185U)
#define EFM_SECTOR_186              (186U)
#define EFM_SECTOR_187              (187U)
#define EFM_SECTOR_188              (188U)
#define EFM_SECTOR_189              (189U)
#define EFM_SECTOR_190              (190U)
#define EFM_SECTOR_191              (191U)
#define EFM_SECTOR_192              (192U)
#define EFM_SECTOR_193              (193U)
#define EFM_SECTOR_194              (194U)
#define EFM_SECTOR_195              (195U)
#define EFM_SECTOR_196              (196U)
#define EFM_SECTOR_197              (197U)
#define EFM_SECTOR_198              (198U)
#define EFM_SECTOR_199              (199U)
#define EFM_SECTOR_200              (200U)
#define EFM_SECTOR_201              (201U)
#define EFM_SECTOR_202              (202U)
#define EFM_SECTOR_203              (203U)
#define EFM_SECTOR_204              (204U)
#define EFM_SECTOR_205              (205U)
#define EFM_SECTOR_206              (206U)
#define EFM_SECTOR_207              (207U)
#define EFM_SECTOR_208              (208U)
#define EFM_SECTOR_209              (209U)
#define EFM_SECTOR_210              (210U)
#define EFM_SECTOR_211              (211U)
#define EFM_SECTOR_212              (212U)
#define EFM_SECTOR_213              (213U)
#define EFM_SECTOR_214              (214U)
#define EFM_SECTOR_215              (215U)
#define EFM_SECTOR_216              (216U)
#define EFM_SECTOR_217              (217U)
#define EFM_SECTOR_218              (218U)
#define EFM_SECTOR_219              (219U)
#define EFM_SECTOR_220              (220U)
#define EFM_SECTOR_221              (221U)
#define EFM_SECTOR_222              (222U)
#define EFM_SECTOR_223              (223U)
#define EFM_SECTOR_224              (224U)
#define EFM_SECTOR_225              (225U)
#define EFM_SECTOR_226              (226U)
#define EFM_SECTOR_227              (227U)
#define EFM_SECTOR_228              (228U)
#define EFM_SECTOR_229              (229U)
#define EFM_SECTOR_230              (230U)
#define EFM_SECTOR_231              (231U)
#define EFM_SECTOR_232              (232U)
#define EFM_SECTOR_233              (233U)
#define EFM_SECTOR_234              (234U)
#define EFM_SECTOR_235              (235U)
#define EFM_SECTOR_236              (236U)
#define EFM_SECTOR_237              (237U)
#define EFM_SECTOR_238              (238U)
#define EFM_SECTOR_239              (239U)
#define EFM_SECTOR_240              (240U)
#define EFM_SECTOR_241              (241U)
#define EFM_SECTOR_242              (242U)
#define EFM_SECTOR_243              (243U)
#define EFM_SECTOR_244              (244U)
#define EFM_SECTOR_245              (245U)
#define EFM_SECTOR_246              (246U)
#define EFM_SECTOR_247              (247U)
#define EFM_SECTOR_248              (248U)
#define EFM_SECTOR_249              (249U)
#define EFM_SECTOR_250              (250U)
#define EFM_SECTOR_251              (251U)
#define EFM_SECTOR_252              (252U)
#define EFM_SECTOR_253              (253U)
#define EFM_SECTOR_254              (254U)
#define EFM_SECTOR_255              (255U)
/**
 * @}
 */

/**
 * @defgroup EFM_Wait_Cycle EFM Wait Cycle
 * @{
 */
#define EFM_WAIT_CYCLE_0                   (0U)      /*!< Don't insert read wait cycle */
#define EFM_WAIT_CYCLE_1                   (1U)      /*!< Insert 1 read wait cycle     */
#define EFM_WAIT_CYCLE_2                   (2U)      /*!< Insert 2 read wait cycles    */
#define EFM_WAIT_CYCLE_3                   (3U)      /*!< Insert 3 read wait cycles    */
#define EFM_WAIT_CYCLE_4                   (4U)      /*!< Insert 4 read wait cycles    */
#define EFM_WAIT_CYCLE_5                   (5U)      /*!< Insert 5 read wait cycles    */
#define EFM_WAIT_CYCLE_6                   (6U)      /*!< Insert 6 read wait cycles    */
#define EFM_WAIT_CYCLE_7                   (7U)      /*!< Insert 7 read wait cycles    */
#define EFM_WAIT_CYCLE_8                   (8U)      /*!< Insert 8 read wait cycles    */
#define EFM_WAIT_CYCLE_9                   (9U)      /*!< Insert 9 read wait cycles    */
#define EFM_WAIT_CYCLE_10                  (10U)     /*!< Insert 10 read wait cycles   */
#define EFM_WAIT_CYCLE_11                  (11U)     /*!< Insert 11 read wait cycles   */
#define EFM_WAIT_CYCLE_12                  (12U)     /*!< Insert 12 read wait cycles   */
#define EFM_WAIT_CYCLE_13                  (13U)     /*!< Insert 13 read wait cycles   */
#define EFM_WAIT_CYCLE_14                  (14U)     /*!< Insert 14 read wait cycles   */
#define EFM_WAIT_CYCLE_15                  (15U)     /*!< Insert 15 read wait cycles   */
/**
 * @}
 */

/**
 * @defgroup EFM_CacheRst_Func EFM data cache reset function
 * @{
 */
#define EFM_CACHERST_ON             (EFM_FRMC_CRST)         /*!< Enable data cache reset function */
#define EFM_CACHERST_OFF            (0x0UL)                 /*!< Disable data cache reset function */
/**
 * @}
 */

/**
 * @defgroup EFM_Prefetch_Func EFM prefetch function
 * @{
 */
#define EFM_PREFETCH_ON             (EFM_FRMC_PREFE)        /*!< Enable prefetch function */
#define EFM_PREFETCH_OFF            (0x0UL)                 /*!< Disable prefetch function */
/**
 * @}
 */

/**
 * @defgroup EFM_DCache_Func EFM data cache function
 * @{
 */
#define EFM_DATACACHE_ON            (EFM_FRMC_DCACHE)       /*!< Enable data cache function */
#define EFM_DATACACHE_OFF           (0x0UL)                 /*!< Disable data cache function */
/**
 * @}
 */

/**
 * @defgroup EFM_INSCache_Func EFM instruction cache function
 * @{
 */
#define EFM_INSCACHE_ON             (EFM_FRMC_ICACHE)       /*!< Enable instruction cache function */
#define EFM_INSCACHE_OFF            (0x0UL)                 /*!< Disable instruction cache function */
/**
 * @}
 */

/**
 * @defgroup EFM_LowVolRead_Mode EFM read of low-voltage mode
 * @{
 */
#define EFM_LOWVOLREAD_ON           (EFM_FRMC_LVM)          /*!< Read of low-voltage mode */
#define EFM_LOWVOLREAD_OFF          (0x0UL)
/**
 * @}
 */

/**
 * @defgroup EFM_Key2Lock_Status EFM key2 lock status
 * @{
 */
#define EFM_KEY2_LOCK               (EFM_FWMC_KEY2LOCK)
#define EFM_KEY2_UNLOCK             (0x0UL)
/**
 * @}
 */

/**
 * @defgroup EFM_Key1Lock_Status EFM key1 lock status
 * @{
 */
#define EFM_KEY1_LOCK               (EFM_FWMC_KEY1LOCK)
#define EFM_KEY1_UNLOCK             (0x0UL)
/**
 * @}
 */

/**
 * @defgroup EFM_Bus_Status EFM Bus status while flash program or erase
 * @{
 */
#define EFM_BUS_BUSY                (0x0UL)                  /*!< Bus busy while flash program or erase */
#define EFM_BUS_RELEASE             (EFM_FWMC_BUSHLDCTL)     /*!< Bus release while flash program or erase */
/**
 * @}
 */

/**
 * @defgroup EFM_OperateMode_Definition EFM program or erase mode definition
 * @{
 */
#define EFM_MODE_PROGRAMSINGLE      (0x1UL)                  /*!< Program single mode          */
#define EFM_MODE_PROGRAMREADBACK    (0x2UL)                  /*!< Program and read back mode   */
#define EFM_MODE_PROGRAMSEQUENCE    (0x3UL)                  /*!< Program sequence mode        */
#define EFM_MODE_ERASESECTOR        (0x4UL)                  /*!< Sector erase mode            */
#define EFM_MODE_ERASECHIP1         (0x5UL)                  /*!< A flash Chip erase mode      */
#define EFM_MODE_ERASEFULL          (0x6UL)                  /*!< Full erase mode    */
#define EFM_MODE_READONLY           (0x0UL)                  /*!< Read only mode               */
/**
 * @}
 */

/**
 * @defgroup EFM_Flag_definition EFM Flag definition
 * @{
 */
#define EFM_FLAG_OTPWERR0           (EFM_FSR_OTPWERR0)       /*!< EFM Flash0 otp Programming/erase error flag.       */
#define EFM_FLAG_PRTWERR0           (EFM_FSR_PRTWERR0)       /*!< EFM Flash0 write protect address error flag.       */
#define EFM_FLAG_PGSZERR0           (EFM_FSR_PGSZERR0)       /*!< EFM Flash0 programming size error flag.            */
#define EFM_FLAG_MISMTCH0           (EFM_FSR_MISMTCH0)       /*!< EFM Flash0 programming missing match error flag.   */
#define EFM_FLAG_OPTEND0            (EFM_FSR_OPTEND0)        /*!< EFM Flash0 end of operation flag.                  */
#define EFM_FLAG_CLOLERR0           (EFM_FSR_COLERR0)        /*!< EFM Flash0 read collide error flag.                */
#define EFM_FLAG_RDY0               (EFM_FSR_RDY0)           /*!< EFM Flash0 ready flag.                             */
#define EFM_FLAG_PRTWERR1           (EFM_FSR_PRTWERR1)       /*!< EFM Flash1 write protect address error flag.       */
#define EFM_FLAG_PGSZERR1           (EFM_FSR_PGSZERR1)       /*!< EFM Flash1 programming size error flag.            */
#define EFM_FLAG_MISMTCH1           (EFM_FSR_MISMTCH1)       /*!< EFM Flash1 programming missing match error flag.   */
#define EFM_FLAG_OPTEND1            (EFM_FSR_OPTEND1)        /*!< EFM Flash1 end of operation flag.                  */
#define EFM_FLAG_CLOLERR1           (EFM_FSR_COLERR1)        /*!< EFM Flash1 read collide error flag.                */
#define EFM_FLAG_RDY1               (EFM_FSR_RDY1)           /*!< EFM Flash1 ready flag.                             */

#define EFM_FLAG_CLR_OTPWERR0       (EFM_FSCLR_OTPWERRCLR0)  /*!< EFM Clear Flash0 otp Programming/erase error flag. */
#define EFM_FLAG_CLR_PRTWERR0       (EFM_FSCLR_PRTWERRCLR0)  /*!< EFM Clear Flash0 write protect address error flag. */
#define EFM_FLAG_CLR_PGSZERR0       (EFM_FSCLR_PGSZERRCLR0)  /*!< EFM Clear Flash0 programming size error flag.      */
#define EFM_FLAG_CLR_MISMTCH0       (EFM_FSCLR_MISMTCHCLR0)  /*!< EFM Clear Flash0 programming miss match error flag.*/
#define EFM_FLAG_CLR_OPTEND0        (EFM_FSCLR_OPTENDCLR0)   /*!< EFM Clear Flash0 end of operation flag.            */
#define EFM_FLAG_CLR_CLOLERR0       (EFM_FSCLR_COLERRCLR0)   /*!< EFM Clear Flash0 read collide error flag.          */
#define EFM_FLAG_CLR_PRTWERR1       (EFM_FSCLR_PRTWERRCLR1)  /*!< EFM Clear Flash1 write protect address error flag. */
#define EFM_FLAG_CLR_PGSZERR1       (EFM_FSCLR_PGSZERRCLR1)  /*!< EFM Clear Flash1 programming size error flag.      */
#define EFM_FLAG_CLR_MISMTCH1       (EFM_FSCLR_MISMTCHCLR1)  /*!< EFM Clear Flash1 programming miss match error flag.*/
#define EFM_FLAG_CLR_OPTEND1        (EFM_FSCLR_OPTENDCLR1)   /*!< EFM Clear Flash1 end of operation flag.            */
#define EFM_FLAG_CLR_CLOLERR1       (EFM_FSCLR_COLERRCLR1)   /*!< EFM Clear Flash1 read collide error flag.          */
/**
 * @}
 */

/**
 * @defgroup EFM_Interrupt_definition EFM Interrupt definition
 * @{
 */
#define EFM_INT_PEERR               (EFM_FITE_PEERRITE)      /*!< Program/erase error Interrupt source    */
#define EFM_INT_OPTEND              (EFM_FITE_OPTENDITE)     /*!< End of EFM operation Interrupt source   */
#define EFM_INT_RDCOLERR            (EFM_FITE_COLERRITE)     /*!< Read collide error Interrupt source     */

