RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_efm.h
#define EFM_INT_MASK                (EFM_FITE_PEERRITE  |  \
                                    EFM_FITE_OPTENDITE  |  \
                                    EFM_FITE_COLERRITE)      /*!< Program/erase error and End of EFM operation \
                                                                  and Read collide error Interrupt source */
/**
 * @}
 */

/**
 * @defgroup EFM_WriteLock_Definition EFM Write protect lock definition
 * @{
 */
#define EFM_WRLOCK0                  (EFM_WLOCK_WLOCK0)       /*!< F0NWPRT0 controlled sector lock   */
#define EFM_WRLOCK1                  (EFM_WLOCK_WLOCK1)       /*!< F0NWPRT1 controlled sector lock   */
#define EFM_WRLOCK2                  (EFM_WLOCK_WLOCK2)       /*!< F0NWPRT2 controlled sector lock   */
#define EFM_WRLOCK3                  (EFM_WLOCK_WLOCK3)       /*!< F0NWPRT3 controlled sector lock   */
#define EFM_WRLOCK4                  (EFM_WLOCK_WLOCK4)       /*!< F1NWPRT0 controlled sector lock   */
#define EFM_WRLOCK5                  (EFM_WLOCK_WLOCK5)       /*!< F1NWPRT1 controlled sector lock   */
#define EFM_WRLOCK6                  (EFM_WLOCK_WLOCK6)       /*!< F1NWPRT2 controlled sector lock   */
#define EFM_WRLOCK7                  (EFM_WLOCK_WLOCK7)       /*!< F1NWPRT3 controlled sector lock   */
/**
 * @}
 */


/**
 * @defgroup EFM_Keys EFM Keys
 * @{
 */
#define EFM_SECRET_KEY1              (0x0123U)
#define EFM_SECRET_KEY2              (0x3210U)
/**
 * @}
 */

/**
 * @defgroup EFM_Status EFM Status
 * @{
 */
#define EFM_FLASH0_ACT_FLASH1_ACT      (0x00000000UL)  /*!< Flash 0 and 1 activity */
#define EFM_FLASH0_STP_FLASH1_ACT      (0x00000001UL)  /*!< Flash 0 stop,Flash 1 activity */
#define EFM_FLASH0_ACT_FLASH1_STP      (0x00000002UL)  /*!< Flash 0 activity,Flash 1 stop */
#define EFM_FLASH0_STP_FLASH1_STP      (0x00000003UL)  /*!< Flash 0 and 1 stop */
/**
 * @}
 */

/**
 * @defgroup EFM_ProtectReg_definition EFM Write protect for register definition
 * @{
 */
#define EFM_PROTECT_FWMC            (0U)
#define EFM_PROTECT_OTP             (1U)
/**
 * @}
 */


/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup EFM_Global_Functions
 * @{
 */

/**
 * @brief  EFM Protect Unlock.
 * @param  None
 * @retval None
 */

__STATIC_INLINE void EFM_Unlock(void)
{
    WRITE_REG16(M4_EFM->FAPRT, EFM_SECRET_KEY1);
    WRITE_REG16(M4_EFM->FAPRT, EFM_SECRET_KEY2);
}

/**
 * @brief  EFM Protect Lock.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void EFM_Lock(void)
{
    WRITE_REG16(M4_EFM->FAPRT, 0x1111U);
}

void EFM_FWMC_Unlock(void);
void EFM_FWMC_Lock(void);
void EFM_OTP_WP_Unlock(void);
void EFM_OTP_WP_Lock(void);

void EFM_Cmd(uint32_t u32EfmStatus);
void EFM_SetWaitCycle(uint32_t u32WaitCycle);
void EFM_SetBusStatus(uint32_t u32Status);
void EFM_DataCacheCmd(en_functional_state_t enNewState);
void EFM_InsCacheCmd(en_functional_state_t enNewState);
void EFM_DataCacheRstCmd(en_functional_state_t enNewState);
void EFM_PrefetchCmd(en_functional_state_t enNewState);
void EFM_InterruptCmd(uint32_t u32EfmInt, en_functional_state_t enNewState);
void EFM_LowVolReadCmd(en_functional_state_t enNewState);
void EFM_SectorRegLock(uint32_t u32EfmRegLock);
void EFM_ClearFlag(uint32_t u32Flag);
void EFM_SectorCmd_Single(uint8_t u8SectorNum, en_functional_state_t enNewState);
en_result_t EFM_StructInit(stc_efm_cfg_t *pstcEfmCfg);
en_result_t EFM_Init(const stc_efm_cfg_t *pstcEfmCfg);
en_result_t EFM_SectorCmd_Sequential(uint32_t u32StartAddr, uint16_t u16SectorCnt,
                                      en_functional_state_t enNewState);
en_result_t EFM_SingleProgram(uint32_t u32Addr, uint32_t u32Data);
en_result_t EFM_ProgramReadBack(uint32_t u32Addr, uint32_t u32Data);
en_result_t EFM_SequenceProgram(uint32_t u32Addr, uint32_t u32Len, const uint32_t *pu32Buf);
en_result_t EFM_SectorErase(uint32_t u32Addr);
en_result_t EFM_OTPLock(uint32_t u32Addr);
en_result_t EFM_ChipErase(uint32_t EraseMode, uint32_t u32Addr);
en_result_t EFM_SwapCmd(en_functional_state_t enNewState);
en_result_t EFM_SetOperateMode(uint32_t u32PgmMode);

en_flag_status_t EFM_GetFlagStatus(uint32_t u32Flag);
void EFM_GetUID(stc_efm_unique_id_t *stcUID);
uint32_t EFM_GetCID(void);
/**
 * @}
 */

#endif /* DDL_EFM_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0_EFM_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
